app/views/restaurantes/show.html.erb

  <b>Nota Média: </b>
  <%= @restaurante.qualificacoes.average(:nota) %>
---
SELECT AVG(`qualificacoes`.`nota`) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 13

  <b>Qualificações: </b>
  <%= @restaurante.qualificacoes.count %>
---
SELECT COUNT(*) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 13

    <b>Preço Médio: </b>
    <%= @restaurante.qualificacoes.average(:valor_gasto) %>
---
SELECT AVG(`qualificacoes`.`valor_gasto`) FROM `qualificacoes` WHERE `qualificacoes`.`restaurante_id` = 13