app/controllers/clientes_controller.rb

SELECT  `clientes`.* FROM `clientes` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `clientes`
---
  def index
    @clientes = Cliente.all.page params['page']

DELETE FROM `clientes` WHERE `clientes`.`id` = 980190962
---
  def destroy
    @cliente.destroy

SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 980190962 LIMIT 1
---
    def set_cliente
      @cliente = Cliente.find(params[:id])