app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT `comentarios`.* FROM `comentarios`

  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`conteudo`, `comentavel_id`, `comentavel_type`, `created_at`, `updated_at`) VALUES ('Testando comentário', 1, 'Restaurante', '2015-03-31 18:08:00', '2015-03-31 18:08:00')

  def destroy
    @comentario.destroy
---
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 3

    def set_comentario
      @comentario = Comentario.find(params[:id])
---
SELECT  `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 980190962 LIMIT 1