app/controllers/restaurantes_controller.rb

SELECT  `restaurantes`.* FROM `restaurantes`  ORDER BY `restaurantes`.`nome` ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `restaurantes`
---
  def index
    @restaurantes = Restaurante.order(:nome).page params['page']

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 2 LIMIT 1
---
  def show
   @restaurante = Restaurante.find(params[:id])

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 2 LIMIT 1
DELETE FROM `restaurantes` WHERE `restaurantes`.`id` = 2
---
  def destroy
   @restaurante = Restaurante.find(params[:id])
   @restaurante.destroy

INSERT INTO `restaurantes` (`nome`, `endereco`, `especialidade`, `created_at`, `updated_at`) VALUES ('Sobremesas', 'Arizona', 'Doces', '2015-03-31 14:51:15', '2015-03-31 14:51:15')
---
  def create
    @restaurante = Restaurante.new restaurante_params
    if @restaurante.save

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1
---
  def edit
    @restaurante = Restaurante.find(params[:id])

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`id` = 4 LIMIT 1
UPDATE `restaurantes` SET `foto_file_name` = 'restaurante-033.jpg', `foto_content_type` = 'image/jpeg', `foto_file_size` = 518510, `foto_updated_at` = '2015-03-31 20:29:57', `updated_at` = '2015-03-31 20:29:57' WHERE `restaurantes`.`id` = 54
---
  def update
    @restaurante = Restaurante.find(params[:id])

    if @restaurante.update_attributes(restaurante_params)

SELECT  `restaurantes`.* FROM `restaurantes` WHERE `restaurantes`.`nome` = '54' LIMIT 1
---
  def busca
    @restaurante = Restaurante.find_by_nome(params[:nome])